Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/documenting.tmx
Source language: en
Languages: pl

source: The following roles create cross-references to C-language constructs if they are defined in the API documentation:
pl: Następujące role tworzą krzyżowe odniesienia do konstrukcji z języka C jeśli są definiowane w dokumentacji sprzęgów (z ang. - API):

source: The name of a C-language variable.
pl: Nazwa zmiennej z języka-C.

source: The name of a C-language function. Should include trailing parentheses.
pl: Nazwa zadania z języka-C. Powinna zawierać kończące znaki nawiasów.

source: The name of a "simple" C macro, as defined above.
pl: Nazwa "prostego" makropolecenia z języka-C jak zdefiniowano powyżej.

source: The name of a C-language type.
pl: Nazwa typu z języka-C.

source: The following role does possibly create a cross-reference, but does not refer to objects:
pl: Następująca rola możliwie tworzy krzyżowe-odniesienie, ale nie odnosi się do przedmiotów:

source: The name of a grammar token (used in the reference manual to create links between production displays).
pl: Nazwa elementu gramatycznego (używana w podręczniku odniesień aby tworzyć połączenia pomiędzy pokazami produkcji).

source: The following role creates a cross-reference to the term in the glossary:
pl: Następująca rola tworzy krzyżowe-odniesienie do terminu w słowniczku:

source: Reference to a term in the glossary. The glossary is created using the ``glossary`` directive containing a definition list with terms and definitions. It does not have to be in the same file as the ``term`` markup, in fact, by default the Python docs have one global glossary in the ``glossary.rst`` file.
pl: Odniesienie do terminu w słowniczku. Słowniczek jest tworzony używając dyrektywy ``glossary`` zawierającej listę definicji z terminami i definicjami. Nie musi być w tym samym pliku co adnotacja ``term``, w rzeczywistości domyślne dokumenty języka pytonowskiego mają jeden nadrzędny słowniczek w pliku ``glossary.rst``.

source: If you use a term that's not explained in a glossary, you'll get a warning during build.
pl: Jeśli używasz terminu który nie jest wyjaśniony w słowniczku, otrzymasz ostrzeżenie w czasie budowy.

source: The following roles don't do anything special except formatting the text in a different style:
pl: Następujące role nie robią nic szczególnego oprócz formatowania tekstu w odmienny sposób:

source: The name of an OS-level command, such as ``rm``.
pl: Nazwa z poziomu systemu operacyjnego, polecenia takiego, jak ``rm``.

source: Mark the defining instance of a term in the text. (No index entries are generated.)
pl: Zaznacz definiujące wystąpienie terminu w tekście. (Nie są generowane żadne wpisy indeksu.)

source: An environment variable. Index entries are generated.
pl: Zmienna środowiskowa. Wpisy indeksu są generowane.

source: The name of a file or directory. Within the contents, you can use curly braces to indicate a "variable" part, for example::
pl: Nazwa pliku lub katalogu. Wewnątrz treści, możesz użyć nawiasów klamrowych aby zaznaczyć część "zmienną", na przykład::

source: ... is installed in :file:`/usr/lib/python2.{x}/site-packages` ...
pl: ... jest zainstalowane w :file:`/usr/lib/python2.{x}/site-packages` ...

source: In the built documentation, the ``x`` will be displayed differently to indicate that it is to be replaced by the Python minor version.
pl: W zbudowanej dokumentacji, ``x`` będzie pokazane inaczej aby zaznaczyć że ma być zamienione przez podrzędny numer wersji języka pytonowskiego.

source: Labels presented as part of an interactive user interface should be marked using ``guilabel``. This includes labels from text-based interfaces such as those created using :mod:`curses` or other text-based libraries. Any label used in the interface should be marked with this role, including button labels, window titles, field names, menu and menu selection names, and even values in selection lists.
pl: Fiszki prezentowane jako część współdziałającego z użytkownikiem graficznego sprzęgu użytkownika powinny być oznaczone używając ``guilabel``. To zawiera fiszki z opartych o teksty sprzęgów użytkownika takich jak te tworzone przy użyciu biblioteki :mod:`curses` lub innych bibliotek opartych o tekst. Jakikolwiek nagłówek (fiszka) użyty w sprzęgu użytkownika powinien być oznaczony tą rolą, zawierając nagłówki przycisków, nagłówki okien, nazwy pól, menu i nazwy wyborów menu, i nawet wartości w listach wyboru.

source: Mark a sequence of keystrokes. What form the key sequence takes may depend on platform- or application-specific conventions. When there are no relevant conventions, the names of modifier keys should be spelled out, to improve accessibility for new users and non-native speakers. For example, an *xemacs* key sequence may be marked like ``:kbd:`C-x C-f```, but without reference to a specific application or platform, the same sequence should be marked as ``:kbd:`Control-x Control-f```.
pl: Oznacz sekwencję naciśnięć przycisków. Jaką formę sekwencje przycisków przyjmują może zależeć od konwencji zależnej od środowiska/maszyny lub konkretnej aplikacji. Gdy nie ma istotnych konwencji, nazwy przycisków modyfikatorów powinny być przeliterowane aby poprawić dostępność dla nowych użytkowników i nie-znających-języka-jako-ojczystego. Dla przykładu, *xemacs* sekwencja przycisków może być oznaczona jako ``:kbd:`C-x C-f```, ale bez odniesienia do szczególnej aplikacji czy maszyny/środowiska, ta sama sekwencja powinna zostać oznaczona jako ``:kbd:`Control-x Control-f```.

source: The name of a keyword in Python.
pl: Nazwa słowa kluczowego w języku pytonowskim.

source: The name of an RFC 822-style mail header. This markup does not imply that the header is being used in an email message, but can be used to refer to any header of the same "style." This is also used for headers defined by the various MIME specifications. The header name should be entered in the same way it would normally be found in practice, with the camel-casing conventions being preferred where there is more than one common usage. For example: ``:mailheader:`Content-Type```.
pl: Nazwa nagłówka poczty w stylu RFC 822. Ta adnotacja nie oznacza że nagłówek który jest używany jest wiadomością e-mail, ale może być użyta aby odwołać się do jakichkolwiek nagłówków tego samego "stylu." To jest także używane dla nagłówków zdefiniowanych przez różne specyfikacje MIME. Nazwa nagłówka powinna być wstawiana w ten sam sposób jak byłaby zwykle znajdowana w praktyce, z konwencjami obudowy-wielbłądziej będącymi preferowanymi tam gdzie jest więcej niż jedno użycie. Na przykład: ``:mailheader:`Typ-Treści```.

source: The name of a :command:`make` variable.
pl: Nazwa zmiennej polecenia :command:`make`.

source: A reference to a Unix manual page including the section, e.g. ``:manpage:`ls(1)```.
pl: Odniesienie do strony podręcznika Unix-a zawierające sekcję, np. ``:manpage:`Is(1)```.

source: Menu selections should be marked using the ``menuselection`` role. This is used to mark a complete sequence of menu selections, including selecting submenus and choosing a specific operation, or any subsequence of such a sequence. The names of individual selections should be separated by ``-->``.
pl: Wybory menu powinny być oznaczone przy użyciu roli ``menuselection``. To jest używane do określenia pełnych sekwencji wyborów menu, zawierających wybory podmenu, i wybór szczególnej operacji, lub jakiekolwiek podsekwencje takiej sekwencji. Nazwy indywidualnych wyborów powinny być rozdzielone za pomocą ``-->``.

source: For example, to mark the selection "Start > Programs", use this markup::
pl: Dla przykładu, aby zaznaczyć wybór "Start > Programy", użyj adnotacji::

source: :menuselection:`Start --> Programs`
pl: :menuselection:`Start --> Programy`

source: When including a selection that includes some trailing indicator, such as the ellipsis some operating systems use to indicate that the command opens a dialog, the indicator should be omitted from the selection name.
pl: Gdy włączasz wybór który zawiera pewne wskazania końcowe, takie jak elipsa niektóre systemy operacyjne używają tego aby oznaczyć że polecenie otwiera dialog, owe wskazanie powinno zostać pominięte z wybranej nazwy.

source: The name of a MIME type, or a component of a MIME type (the major or minor portion, taken alone).
pl: Nazwa typu MIME, lub składnika typu MIME (większej lub mniejszej części, branej pojedynczo).

source: The name of a Usenet newsgroup.
pl: Nazwa grupy dyskusyjnej Usenetu.

source: A command-line option to an executable program. The leading hyphen(s) must be included.
pl: Opcja wiersza-poleceń dla programu wykonywalnego. wiodący myślnik(i) musi być załączony.

source: The name of an executable program. This may differ from the file name for the executable for some platforms. In particular, the ``.exe`` (or other) extension should be omitted for Windows programs.
pl: Nazwa programu wykonywalnego. To może się różnić od nazwy pliku dla programu wykonywalnego na niektórych maszynach/środowiskach. w szczególności, ``.exe`` (lub inne) rozszerzenia powinny być pominięte dla programów Windowsowskich.

source: A regular expression. Quotes should not be included.
pl: Wyrażenie regularne. Znaki cytowania nie powinny być załączane.

source: A piece of literal text, such as code. Within the contents, you can use curly braces to indicate a "variable" part, as in ``:file:``.
pl: Kawałek literalnego tekstu, taki jak kod. Wewnątrz treści, możesz użyć nawiasów klamrowych, aby oznaczyć "zmienną" część, jak w ``:file:``.

source: If you don't need the "variable part" indication, use the standard ````code```` instead.
pl: Jeśli nie potrzebujesz wskazywać "zmiennej części", użyj standardowego ````kodu```` w zamian za to.

source: A Python or C variable or parameter name.
pl: Nazwa parametru lub zmiennej z języka pytonowskiego lub języka-C.

source: The following roles generate external links:
pl: Następujące role tworzą zewnętrzne połączenia:

source: A reference to a Python Enhancement Proposal. This generates appropriate index entries. The text "PEP *number*\ " is generated; in the HTML output, this text is a hyperlink to an online copy of the specified PEP.
pl: Odniesienie do propozycji ulepszenia języka pytonowskiego ( - z ang. - Python Enhancement Proposal - w skrócie PEP). To wytwarza właściwe wpisy indeksu. Tekst "PEP *numer*\ " jest tworzony, w wyjściu HTML, ten tekst jest hiperłączem do sieciowej kopii wyszczególnionego PEP.

source: A reference to an Internet Request for Comments. This generates appropriate index entries. The text "RFC *number*\ " is generated; in the HTML output, this text is a hyperlink to an online copy of the specified RFC.
pl: Odniesienie do Internetowego dokumentu prośby o skomentowanie ( - z ang. - Request for Comments - w skrócie RFC). To generuje właściwy wpisy indeksu. Tekst "RFC *numer*\ " jest tworzony; w wyjściu HTML, ten tekst jest hiperłączem do sieciowej kopii wyszczególnionego RFC.

source: Note that there are no special roles for including hyperlinks as you can use the standard reST markup for that purpose.
pl: Zauważ że nie ma szczególnych ról dla zawarcia hiperłączy jako że możesz użyć standardowych adnotacji reST dla tego celu.

source: Cross-linking markup
pl: adnotacje łącz-krzyżowych

source: To support cross-referencing to arbitrary sections in the documentation, the standard reST labels are "abused" a bit: Every label must precede a section title; and every label name must be unique throughout the entire documentation source.
pl: Aby wspierać krzyżowe-odniesienia do określonych sekcji w dokumentacji, standardowe nagłówki reST są nieco "nadużywane": Każdy nagłówek musi być unikatowy w całym źródle dokumentacji.

source: You can then reference to these sections using the ``:ref:`label-name``` role.
pl: Możesz potem odnieść się do tych sekcji używając roli ``:ref:`label-name```.

source: Example::
pl: Przykład::

source: .. _my-reference-label: Section to cross-reference -------------------------- This is the text of the section. It refers to the section itself, see :ref:`my-reference-label`.
pl: .. _mój-nagłówek-odniesienia: Sekcja od odniesień-krzyżowych --------------------- To jest tekst sekcji. Odnosi się on do tej samej sekcji, zobacz :ref:`mój-nagłówek-odniesienia`.

source: The ``:ref:`` invocation is replaced with the section title.
pl: Zawezwanie ``:ref:`` jest podmieniane przez tytuł sekcji.

source: Paragraph-level markup
pl: Adnotacje na poziomie-paragrafu

source: These directives create short paragraphs and can be used inside information units as well as normal text:
pl: Te dyrektywy tworzą krótkie paragrafy i mogą być używane wewnątrz jednostek informacji jak również jako zwykły tekst:

source: An especially important bit of information about an API that a user should be aware of when using whatever bit of API the note pertains to. The content of the directive should be written in complete sentences and include all appropriate punctuation.
pl: Szczególnie istotny kawałek informacji o sprzęgu programowania o którym użytkownik powinien wiedzieć gdy używany będzie jakikolwiek kawałek sprzęgu do którego odnosi się notatka. Zawartość dyrektywy powinna być zapisana całymi zdaniami i zawierać wszystkie właściwe znaki przestankowe.

source: .. note:: This function is not suitable for sending spam e-mails.
pl: .. note:: To zadanie nie jest właściwe dla wysyłania e-maili spamowych.

source: An important bit of information about an API that a user should be aware of when using whatever bit of API the warning pertains to. The content of the directive should be written in complete sentences and include all appropriate punctuation. In the interest of not scaring users away from pages filled with warnings, this directive should only be chosen over ``note`` for information regarding the possibility of crashes, data loss, or security implications.
pl: Istotna część informacji o sprzęgu programowania aplikacji (w skrócie z ang. - API) o której użytkownik powinien wiedzieć gdy zamierza użyć jakiegokolwiek fragmentu sprzęgu programowania aplikacji do którego ostrzeżenie się odnosi. Treść dyrektywy powinna być napisana pełnymi zdaniami i zawierać wszystkie właściwe znaki przestankowe. W interesie aby nie odstraszyć użytkowników od stron zapełnionych ostrzeżeniami, dyrektywa powinna tylko być wybrana zamiast ``notatki`` dla informacji odnoszących się do możliwości błędów, utraty danych, lub względów bezpieczeństwa.

source: This directive documents the version of Python which added the described feature to the library or C API. When this applies to an entire module, it should be placed at the top of the module section before any prose.
pl: Ta dyrektywa dokumentuje wersję języka pytonowskiego, która dodała opisywaną własność do biblioteki lub sprzęgu C. Gdy to odnosi się do całego modułu, to powinno być umieszczone na górze sekcji modułu przed jakąkolwiek prozą.

source: The first argument must be given and is the version in question; you can add a second argument consisting of a *brief* explanation of the change.
pl: Pierwszy parametr musi zostać podany i jest wersją o którą pytano; można dodać drugi parametr składający się z *krótkiego* wyjaśnienia zmian.

source: .. versionadded:: 3.1 The *spam* parameter.
pl: .. versionadded:: 3.1 parametr *spam*.

source: Note that there must be no blank line between the directive head and the explanation; this is to make these blocks visually continuous in the markup.
pl: Zauważ że nie może być linii pustych pomiędzy nagłówkiem dyrektywy i wyjaśnieniem; to jest po to by uczynić te bloki wizualnie jednym ciągiem w adnotacjach.

source: Similar to ``versionadded``, but describes when and what changed in the named feature in some way (new parameters, changed side effects, etc.).
pl: Podobne do ``versionadded``, ale opisuje kiedy i co zmieniło się w nazwanej właściwości w pewien sposób (nowe parametry, zmienione efekty uboczne, itp.).

source: This directive is used to mark CPython-specific information. Use either with a block content or a single sentence as an argument, i.e. either ::
pl: Ta dyrektywa jest używana do oznaczenia informacji szczególnej dla CPythona. Używaj albo z zawartością bloku lub pojedynczym zdaniem jako parametrem t.j. albo ::

source: .. impl-detail:: This describes some implementation detail. More explanation.
pl: .. impl-detail:: To opisuje pewien szczegół wypełnienia zadania. Więcej wyjaśnień.

source: or ::
pl: lub ::

source: .. impl-detail:: This shortly mentions an implementation detail.
pl: .. impl-detail:: To krótko wspomina jakiś szczegół wypełnienia zadania.

source: "\ **CPython implementation detail:**\ " is automatically prepended to the content.
pl: "\ **Szczegół wypełnienia zadania CPyton:**\ " jest automatycznie dołączany do treści.

source: Many sections include a list of references to module documentation or external documents. These lists are created using the ``seealso`` directive.
pl: Wiele sekcji zawiera listę odniesień do dokumentacji modułu lub zewnętrznych dokumentów. Te listy są tworzone używając dyrektywy ``seealso``.

source: The ``seealso`` directive is typically placed in a section just before any sub-sections. For the HTML output, it is shown boxed off from the main flow of the text.
pl: Dyrektywa ``seealso`` jest typowo umieszczana w sekcji tuż przed jakąś pod-sekcją. Dla wyjścia HTML, to jest pokazane oddzielone od głównego przepływu tekstu.

source: The content of the ``seealso`` directive should be a reST definition list. Example::
pl: Treść dyrektywy ``seealso`` powinna być listą definicji reST. Na przykład::

source: .. seealso:: Module :mod:`zipfile` Documentation of the :mod:`zipfile` standard module. `GNU tar manual, Basic Tar Format <http://link>`_ Documentation for tar archive files, including GNU tar extensions.
pl: .. seealso:: Moduł :mod:`zipfile` Dokumentacja standardowego modułu :mod:`zipfile`. `podręcznik GNU tar, Podstawowy Format Tar <http://link>`_ Dokumentacja dla plików archiwum tar, zawierająca rozszerzenia GNU tar.

source: This directive creates a paragraph heading that is not used to create a table of contents node. It is currently used for the "Footnotes" caption.
pl: Ta dyrektywa tworzy nagłówek paragrafu, który nie jest używany do tworzenia elementu spisu treści. Jest obecnie używany do fiszki "przypisów dolnych"

source: This directive creates a centered boldfaced paragraph. Use it as follows::
pl: Ta dyrektywa tworzy wycentrowany pogrubiony paragraf. Używaj jej jak następuje::

source: .. centered:: Paragraph contents.
pl: .. centered:: Treść paragrafu.

source: Table-of-contents markup
pl: Adnotacje spisu-treści

source: Since reST does not have facilities to interconnect several documents, or split documents into multiple output files, Sphinx uses a custom directive to add relations between the single files the documentation is made of, as well as tables of contents. The ``toctree`` directive is the central element.
pl: Odkąd reST nie posiada urządzeń do łączenia wielu dokumentów, ani dzieleni dokumentów na wiele plików wyjściowych, Sphinx używa szczególnej dyrektywy do dodawania relacji pomiędzy pojedynczymi plikami z której składa się dokumentacja, tak jak spisów treści. Dyrektywa ``toctree`` jest centralnym elementem.

source: This directive inserts a "TOC tree" at the current location, using the individual TOCs (including "sub-TOC trees") of the files given in the directive body. A numeric ``maxdepth`` option may be given to indicate the depth of the tree; by default, all levels are included.
pl: Ta dyrektywa wstawia "drzewo TOC (spisu treści)" w obecnym położeniu, używając pojedynczych TOCów (zawierając "podrzędne-drzewa TOC") plików danych w treści dyrektywy. Numeryczna opcja ``maxdepth`` może być podana aby zaznaczyć głębokość drzewa; domyślnie wszystkie poziomy są załączone.

source: Consider this example (taken from the library reference index)::
pl: Rozważ ten przykład (wzięty z indeksu odniesień bibliotek)::

source: .. toctree:: :maxdepth: 2 intro strings datatypes numeric (many more files listed here)
pl: .. toctree:: maxdepth: 2 ciągi początkowe typy-danych numeryczne (wiele więcej plików wypisanych tutaj)

source: This accomplishes two things:
pl: To załatwia dwie rzeczy:

source: Tables of contents from all those files are inserted, with a maximum depth of two, that means one nested heading. ``toctree`` directives in those files are also taken into account.
pl: Spisy treści z tych wszystkich plików są wstawiane, z maksymalną głębokością dwóch, co oznacza jeden zagnieżdżony nagłówek. Dyrektywy ``toctree`` w tych plikach są także brane pod uwagę.

source: Sphinx knows that the relative order of the files ``intro``, ``strings`` and so forth, and it knows that they are children of the shown file, the library index. From this information it generates "next chapter", "previous chapter" and "parent chapter" links.
pl: Sphinx zna zależny porządek plików ``intro``, ``strings`` itd. i wie że są dziećmi pokazanego pliku, indeksu bibliotecznego. Z tej informacji generuje odniesienia: "następny rozdział", "poprzedni rozdział" i "rozdział nadrzędny".

source: In the end, all files included in the build process must occur in one ``toctree`` directive; Sphinx will emit a warning if it finds a file that is not included, because that means that this file will not be reachable through standard navigation.
pl: W końcu, wszystkie pliki załączone w procesie budowy muszą pojawić się w jednej dyrektywie ``toctree``; Sphinx wytworzy ostrzeżenie jeśli znajdzie plik który nie jest załączony, ponieważ to oznacza że ten plik nie będzie dostępny przez standardową nawigację.

source: The special file ``contents.rst`` at the root of the source directory is the "root" of the TOC tree hierarchy; from it the "Contents" page is generated.
pl: Szczególny plik ``contents.rst`` u korzenia katalogu źródeł jest "korzeniem" hierarchii drzewa TOC (spisu treści); z niego strona "Treść" jest generowana.

source: Index-generating markup
pl: adnotacje generujące-indeks

source: Sphinx automatically creates index entries from all information units (like functions, classes or attributes) like discussed before.
pl: Sphinx automatycznie tworzy wpisy indeksu ze wszystkich jednostek informacyjnych (takich jak zadania, uogólnienia, i właściwości) jak omówiono wcześniej.

source: However, there is also an explicit directive available, to make the index more comprehensive and enable index entries in documents where information is not mainly contained in information units, such as the language reference.
pl: Jednakże, jest także jawna dyrektywa dostępna, aby uczynić indeks bardziej czytelnym i umożliwić wpisy indeksu w dokumentach gdzie informacja nie jest głównie zawarta w jednostkach informacji, takie jak odniesienia do języka.

source: The directive is ``index`` and contains one or more index entries. Each entry consists of a type and a value, separated by a colon.
pl: Dyrektywą jest ``index`` i zawiera jedno lub więcej wpisów indeksu. Każdy wpis składa się z typu i wartości, oddzielonych dwukropkiem.

source: For example::
pl: Dla przykładu::

source: This directive contains five entries, which will be converted to entries in the generated index which link to the exact location of the index statement (or, in case of offline media, the corresponding page number).
pl: Ta dyrektywa zawiera pięć wpisów, które będą konwertowane na wpisy w generowanym indeksie który łączy z dokładnym położeniem wyrażenia indeksu (lub w przypadku medium nie-sieciowego, odpowiadającemu numerowi strony).

source: The possible entry types are:
pl: Możliwe rodzaje wpisów to:
